# Напишите программу, которая по заданному номеру четверти,
# показывает диапазон возможных координат точек в этой четверти (x и y)

koord = ['', 'X > 0, Y > 0', 'X < 0, Y > 0', 'X < 0, Y < 0', 'X > 0, Y < 0']
print(koord[int(input('Введи номер четверти -> '))])